[
  {
    "title": "Uni Retail Platform (URP)",
    "summary": "Lead architect for a high-scale logistics platform, driving the transition to a serverless 'Lambdalith' architecture with 28+ microservices for cross-border shipping operations.",
    "details": "Architected a serverless microservices backend on AWS Lambda handling shipments, payments, and multi-carrier integrations. Integrated Borderline Genius API for real-time US duty and tariff calculations on HTS codes. Built Retool-based analytics dashboards and optimized pickup flows with serviceability filtering.",
    "stack": [
      "TypeScript",
      "Node.js",
      "AWS Lambda",
      "Prisma",
      "PostgreSQL",
      "Retool",
      "PostNL",
      "Wizmo"
    ],
    "github": "",
    "demo": "https://ship.uniuni.com/"
  },
  {

    "title": "Harry Rosen (E-Commerce Platform)",
    "summary": "Played a core role as a senior backend engineer, driving architectural decisions, service migrations, and reliability improvements in a production-critical environment.",
    "details": "Led full infrastructure migration from IBM Cloud to GCP (GKE, Cloud Functions). Architected blue-green CI/CD pipelines with GitHub Actions, reducing incidents by 50%. Tuned MongoDB sharding for 25% latency reduction. Migrated retry systems to Kafka and designed real-time event syncing for CommerceTools/Algolia. Rebuilt loyalty system (TalonOne) and integrated headless checkout (Bold Commerce).",
    "stack": [
      "GCP",
      "Kubernetes",
      "Kafka",
      "MongoDB",
      "Node.js",
      "TypeScript",
      "Terraform",
      "Amplience",
      "CommerceTools",
      "Algolia"
    ],
    "github": "",
    "demo": "https://www.harryrosen.com/en"
  },
  {
    "title": "Headless Checkout (Bold Commerce)",
    "summary": "Integrated Bold Commerce headless checkout (beta) with modular adapters and fallbacks for a mobile-first checkout experience.",
    "details": "Integrated Bold Commerce's beta headless checkout in production: worked with Bold engineering, implemented robust error handling, fallback logic, and cross-team testing. Launched with zero downtime and measurable improvements in page speed and cart conversion.",
    "stack": [
      "Bold Commerce",
      "JavaScript",
      "React",
      "Next.js",
      "TypeScript",
      "Chakra UI"
    ],
    "github": "",
    "demo": "https://checkout.harryrosen.com"
  },
  {
    "title": "Shopfinalcut",
    "summary": "Launched a new outlet store reusing core services with feature flags, shipping, and subtotal/discount adjustments.",
    "details": "Added feature flags across data models and services to support a new outlet store; updated checkout integration for same-day shipping and subtotal/discount logic; launched shopfinalcut successfully using the existing backend platform.",
    "stack": [
      "Node.js",
      "CommerceTools",
      "Feature Flags"
    ],
    "github": "",
    "demo": "https://www.shopfinalcut.com/en"
  },
  {
    "title": "FintelConnect — Affiliate Platform",
    "summary": "Frontend lead + full-stack contributor for a real-time affiliate marketing platform adopted by banks and fintechs.",
    "details": "Led frontend development of real-time dashboards and performance optimizations; contributed to backend architecture and AWS infra (Lambda, EC2, MongoDB, Auth0). Platform won two FinXTech Awards including Best Solution for Revenue Growth.",
    "stack": [
      "React",
      "AWS",
      "MongoDB",
      "Auth0",
      "GraphQL",
      "Node.js",
      "TypeScript"
    ],
    "github": "",
    "demo": "https://app.fintelconnect.com"
  },
  {
    "title": "Eventer (Full-Stack)",
    "summary": "Group project for an outdoor events management system using Google APIs and Open-Weather API.",
    "details": "Responsible for using Google APIs (OAuth, Map and Location) and Open-Weather API on the Activities Page and Admin Page, and image files transformation by Multer.",
    "stack": [
      "React",
      "NodeJS",
      "JavaScript",
      "Google Maps API",
      "OpenWeather API"
    ],
    "github": "https://github.com/XiaoyongXu/Eventer",
    "demo": ""
  },
  {
    "title": "Jungle (E-commerce)",
    "summary": "Implemented core e-commerce features including Sold Out badges, Admin Categories, and User Auth.",
    "details": "Implemented features of \"Product Sold Out - Badge\", \"Admin Categories\", \"User Authentication\", \"Order Details\", \"E-mail Receipt\" and \"Product Ratings\". Fixed bugs including \"Missing Admin Security\" and \"Checking out with Empty Cart\".",
    "stack": [
      "Ruby on Rails",
      "PostgreSQL",
      "Stripe"
    ],
    "github": "https://github.com/XiaoyongXu/jungle-rails",
    "demo": ""
  },
  {
    "title": "ChattyApp",
    "summary": "A multi-user real-time communication app built with React and WebSockets.",
    "details": "Real-time messaging application featuring live user online status, message notifications, and instant updates using WebSockets. Built with a React frontend and a Node.js WebSocket server.",
    "stack": [
      "React",
      "WebSockets",
      "Node.js",
      "Webpack"
    ],
    "github": "https://github.com/XiaoyongXu/ChattyApp",
    "demo": ""
  },
  {
    "title": "Wordle Game",
    "summary": "A modern, full-stack implementation of the popular word-guessing game with real-time multiplayer and 'cheating' modes.",
    "details": "Built a client-server architecture with React and Node.js/Express. Features include a 'Host Cheating' mode (Absurdle style), real-time multiplayer using WebSockets (Head-to-Head, Race, Hybrid modes), player statistics tracking in localStorage, and an interactive on-screen keyboard.",
    "stack": [
      "React",
      "TypeScript",
      "Node.js",
      "Express",
      "WebSockets",
      "Vite",
      "Turbo"
    ],
    "github": "https://github.com/XiaoyongXu/wordle-game",
    "demo": ""
  },
  {
    "title": "Charity (IOS Mobile App)",
    "summary": "Collaborated on a mental health mobile app offering anxiety treatment plans and mini-games.",
    "details": "Collaborated on Clarity, a mental health mobile app that offers personalized anxiety treatment plans, mini-games, data tracking, and a community message board. Designed and implemented the UFO game, an interactive mini-game aimed at reducing anxiety through engaging, fast-paced gameplay.",
    "stack": [
      "Xcode",
      "Swift"
    ],
    "github": "",
    "demo": ""
  },
  {
    "title": "Bidfy — MVP Delivery",
    "summary": "Delivered an MVP (RSS feed + AWS Lambda + DynamoDB) quickly to validate market response in 3 sprints.",
    "details": "Built a cost-efficient MVP using serverless components (Lambda, DynamoDB) and an RSS ingestion pipeline to validate product-market fit in a short timeframe.",
    "stack": [
      "AWS Lambda",
      "DynamoDB",
      "RSS"
    ],
    "github": "",
    "demo": ""
  }
]